get_event_document.txt

<?xml version="1.0" encoding="utf-8"?>
<env:Envelope
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
     <env:Header>
        <wsse:Security env:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>$Username</wsse:Username>
                <wsse:Password
                    Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">$Password</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </env:Header>
	<env:Body>
		<wd:Get_Event_Documents_Request xmlns:wd="urn:com.workday/bsvc" wd:version="v40.2">
			<wd:Request_References wd:Ignore_Invalid_References="true">
				<wd:Integration_Event_Reference>
					<wd:ID wd:type="WID">$WID_Integration_event</wd:ID>
				</wd:Integration_Event_Reference>
			</wd:Request_References>
		</wd:Get_Event_Documents_Request>
	</env:Body>
</env:Envelope>